---
kind: other
id: Methods.T:Autodesk.Revit.DB.SubTransaction
source: html/92c14dcd-c340-abe9-b61f-a367f618e6d1.htm
---
# SubTransaction Methods

Commits all changes made to the model made during the sub-transaction.